#include <iostream>

int main(int argc, char* argv[])
{
    int n = 0;
    int b = 437; // ¬ысота автобуса в сантиметрах
    scanf_s("%d", &n);// ¬водим количество мостов
  
   for (int i = 1; i <= n; ++i)
   {
       int b0 = 0;
       scanf_s("%d", &b0); // ¬водим высоту текущего моста

        if (b0 <= b) // ≈сли высота моста меньше или равна высоте автобуса, произойдет авари€
        {
            printf("Crash ");
            printf("%d", i);
            return 0;  // «авершаем программу, так как автобус не проедет дальше
        }
   }
    printf("No crash"); // ≈сли ни под одним мостом аварии не произошло
    return 0;
}